; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 351617 1 2 4 3 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	image3 - mode
	image1 - mode
	infrared2 - mode
	image0 - mode
	Star1 - direction
	GroundStation0 - direction
	Star2 - direction
	Phenomenon3 - direction
	Star4 - direction
	Star5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Planet8 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 image1)
	(supports instrument0 infrared2)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 image3)
	(supports instrument1 image0)
	(supports instrument1 image1)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
)
(:goal (and
	(pointing satellite0 Star5)
	(have_image Phenomenon3 infrared2)
	(have_image Star4 image1)
	(have_image Star5 image1)
	(have_image Star6 infrared2)
	(have_image Phenomenon7 infrared2)
	(have_image Planet8 image1)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
2. (turn_to satellite0 groundstation0 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 groundstation0)
   goals met: 0 of 7
3. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 0 of 7
4. (turn_to satellite0 star6 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star6)
   goals met: 0 of 7
5. (take_image satellite0 star6 instrument0 infrared2)
   added: (have_image star6 infrared2)
   goals met: 1 of 7
6. (turn_to satellite0 star5 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star5)
   goals met: 2 of 7
7. (take_image satellite0 star5 instrument0 image1)
   added: (have_image star5 image1)
   goals met: 3 of 7
8. (turn_to satellite0 planet8 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 planet8)
   goals met: 2 of 7
9. (take_image satellite0 planet8 instrument0 image1)
   added: (have_image planet8 image1)
   goals met: 3 of 7
10. (turn_to satellite0 star5 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star5)
   goals met: 4 of 7
11. (turn_to satellite0 phenomenon7 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon7)
   goals met: 3 of 7
12. (take_image satellite0 phenomenon7 instrument0 infrared2)
   added: (have_image phenomenon7 infrared2)
   goals met: 4 of 7
13. (turn_to satellite0 star5 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star5)
   goals met: 5 of 7
14. (turn_to satellite0 phenomenon3 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon3)
   goals met: 4 of 7
15. (take_image satellite0 phenomenon3 instrument0 infrared2)
   added: (have_image phenomenon3 infrared2)
   goals met: 5 of 7
16. (turn_to satellite0 star5 phenomenon3)
   deleted: (pointing satellite0 phenomenon3)
   added: (pointing satellite0 star5)
   goals met: 6 of 7
17. (turn_to satellite0 star4 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star4)
   goals met: 5 of 7
18. (take_image satellite0 star4 instrument0 image1)
   added: (have_image star4 image1)
   goals met: 6 of 7
19. (turn_to satellite0 star5 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star5)
   goals met: 7 of 7
